; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v3 - type_2 ?v1 - type_1)
 	      (pred_2 ?v8 - object ?v1 - type_1)
	      (pred_4 ?v3 - type_2 ?v5 - type_3)
	      (pred_1 ?v3 - type_2 ?v8 - object ?v5 - type_3))

   (:action op_1
       :parameters  (?v3 - type_2 ?v4 ?v7 - type_1)
       :precondition (and  (pred_3 ?v3 ?v4))
       :effect (and  (pred_3 ?v3 ?v7)
		     (not (pred_3 ?v3 ?v4))))

   (:action op_2
       :parameters (?v3 - type_2 ?v6 - object ?v2 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v2) (pred_3 ?v3 ?v2) (pred_4 ?v3 ?v5))
       :effect (and (pred_1 ?v3 ?v6 ?v5)
		    (not (pred_2 ?v6 ?v2)) 
		    (not (pred_4 ?v3 ?v5))))

   (:action op_3
       :parameters (?v3 - type_2 ?v6 - object ?v2 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v6 ?v5) (pred_3 ?v3 ?v2))
       :effect (and (pred_2 ?v6 ?v2)
		    (pred_4 ?v3 ?v5)
		    (not (pred_1 ?v3 ?v6 ?v5)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_05 obj_04 - type_2
obj_10 obj_09 obj_01 obj_12 - type_3
obj_08 obj_13 obj_14 obj_07 - type_1
obj_06 obj_02 obj_11 obj_03 - object)
(:init
(pred_3 obj_05 obj_08)
(pred_4 obj_05 obj_10)
(pred_4 obj_05 obj_09)
(pred_3 obj_04 obj_07)
(pred_4 obj_04 obj_01)
(pred_4 obj_04 obj_12)
(pred_2 obj_06 obj_14)
(pred_2 obj_02 obj_14)
(pred_2 obj_11 obj_08)
(pred_2 obj_03 obj_07)
)
(:goal
(and
(pred_2 obj_06 obj_13)
(pred_2 obj_02 obj_07)
(pred_2 obj_11 obj_13)
(pred_2 obj_03 obj_07)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_05 obj_13) (pred_3 obj_04 obj_13))))
  )
)
)

; plan
1. (op_2 obj_05 obj_11 obj_08 obj_09)
   deleted: (pred_2 obj_11 obj_08) (pred_4 obj_05 obj_09)
   added: (pred_1 obj_05 obj_11 obj_09)
   goals met: 1 of 4
2. (op_1 obj_04 obj_07 obj_14)
   deleted: (pred_3 obj_04 obj_07)
   added: (pred_3 obj_04 obj_14)
   goals met: 1 of 4
3. (op_1 obj_05 obj_08 obj_13)
   deleted: (pred_3 obj_05 obj_08)
   added: (pred_3 obj_05 obj_13)
   goals met: 1 of 4
4. (op_2 obj_04 obj_02 obj_14 obj_12)
   deleted: (pred_2 obj_02 obj_14) (pred_4 obj_04 obj_12)
   added: (pred_1 obj_04 obj_02 obj_12)
   goals met: 1 of 4
5. (op_2 obj_04 obj_06 obj_14 obj_01)
   deleted: (pred_2 obj_06 obj_14) (pred_4 obj_04 obj_01)
   added: (pred_1 obj_04 obj_06 obj_01)
   goals met: 1 of 4
6. (op_3 obj_05 obj_11 obj_13 obj_09)
   deleted: (pred_1 obj_05 obj_11 obj_09)
   added: (pred_2 obj_11 obj_13) (pred_4 obj_05 obj_09)
   goals met: 2 of 4
7. (op_1 obj_04 obj_14 obj_07)
   deleted: (pred_3 obj_04 obj_14)
   added: (pred_3 obj_04 obj_07)
   goals met: 2 of 4
8. (op_3 obj_04 obj_02 obj_07 obj_12)
   deleted: (pred_1 obj_04 obj_02 obj_12)
   added: (pred_2 obj_02 obj_07) (pred_4 obj_04 obj_12)
   goals met: 3 of 4
9. (op_1 obj_05 obj_13 obj_08)
   deleted: (pred_3 obj_05 obj_13)
   added: (pred_3 obj_05 obj_08)
   goals met: 3 of 4
10. (op_1 obj_04 obj_07 obj_13)
   deleted: (pred_3 obj_04 obj_07)
   added: (pred_3 obj_04 obj_13)
   goals met: 3 of 4
11. (op_3 obj_04 obj_06 obj_13 obj_01)
   deleted: (pred_1 obj_04 obj_06 obj_01)
   added: (pred_2 obj_06 obj_13) (pred_4 obj_04 obj_01)
   goals met: 4 of 4
